; ModuleID = 'build/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-p270:32:32-p271:32:32-p272:64:64-f64:32:64-f80:32-n8:16:32-S128"
target triple = "i386-unknown-linux-gnu"

%struct.llext_const_symbol = type { i8*, i8* }
%struct.threads_table_el = type { i32, i8, i32, i32, %struct.posix_thread_status_t* }
%struct.posix_thread_status_t = type { void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.__atomic_wide_counter, %union.__atomic_wide_counter, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.__atomic_wide_counter = type { i64 }
%struct.anon.4 = type { i16, i16 }
%struct.args_struct_t = type { i8, i8, i8, i8*, i8*, i8, i8*, void (i8*, i32)*, i8* }
%struct.anon.42 = type { double, double, double, double }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i32, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i32, i32, [40 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.init_entry = type { %union.init_function, %struct.device* }
%union.init_function = type { i32 ()* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8* }
%struct.device_state = type { i8, i8 }

!54 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 45, isUnsigned: true)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 46, isUnsigned: true)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 47, isUnsigned: true)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 48, isUnsigned: true)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 49, isUnsigned: true)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 50, isUnsigned: true)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 51, isUnsigned: true)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 52, isUnsigned: true)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 53, isUnsigned: true)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 54, isUnsigned: true)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 55, isUnsigned: true)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 56, isUnsigned: true)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57, isUnsigned: true)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58, isUnsigned: true)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59, isUnsigned: true)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60, isUnsigned: true)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61, isUnsigned: true)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62, isUnsigned: true)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63, isUnsigned: true)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 64, isUnsigned: true)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 65, isUnsigned: true)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 66, isUnsigned: true)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 67, isUnsigned: true)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 68, isUnsigned: true)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 69, isUnsigned: true)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 70, isUnsigned: true)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 71, isUnsigned: true)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 72, isUnsigned: true)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 73, isUnsigned: true)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 74, isUnsigned: true)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 75, isUnsigned: true)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 76, isUnsigned: true)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 77, isUnsigned: true)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 78, isUnsigned: true)
!88 = !DIEnumerator(name: "K_OBJ_LAST", value: 79, isUnsigned: true)
!89 = !{!90, !91, !101, !138, !95, !139}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!91 = !DISubprogram(name: "vsnprintk", scope: !92, file: !92, line: 74, type: !93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!92 = !DIFile(filename: "include/zephyr/sys/printk.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !96, !7, !98, !96}
!95 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!100 = !{}
!101 = !DISubprogram(name: "z_timeout_expires", scope: !102, file: !102, line: 646, type: !103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!102 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !106}
!105 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !109, line: 254, size: 160, elements: !110)
!109 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!110 = !{!111, !127, !133}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !108, file: !109, line: 255, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !113, line: 55, baseType: !114)
!113 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !113, line: 37, size: 64, elements: !115)
!115 = !{!116, !122}
!116 = !DIDerivedType(tag: DW_TAG_member, scope: !114, file: !113, line: 38, baseType: !117, size: 32)
!117 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !114, file: !113, line: 38, size: 32, elements: !118)
!118 = !{!119, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !117, file: !113, line: 39, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !113, line: 40, baseType: !120, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, scope: !114, file: !113, line: 42, baseType: !123, size: 32, offset: 32)
!123 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !114, file: !113, line: 42, size: 32, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !123, file: !113, line: 43, baseType: !120, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !123, file: !113, line: 44, baseType: !120, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !108, file: !109, line: 256, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !109, line: 252, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !108, file: !109, line: 259, baseType: !134, size: 64, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !135, line: 27, baseType: !136)
!135 = !DIFile(filename: "/usr/include/bits/stdint-intn.h", directory: "")
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !137, line: 47, baseType: !105)
!137 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!138 = !DISubprogram(name: "z_timeout_remaining", scope: !102, file: !102, line: 647, type: !103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!139 = !DISubprogram(name: "z_cbvprintf_impl", scope: !140, file: !140, line: 712, type: !141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!140 = !DIFile(filename: "include/zephyr/sys/cbprintf.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!141 = !DISubroutineType(types: !142)
!142 = !{!95, !143, !90, !98, !96, !7}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DISubroutineType(types: !145)
!145 = !{!95, null}
!146 = !{!0, !147}
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "printk_sym", scope: !2, file: !149, line: 214, type: !150, isLocal: true, isDefinition: true, align: 32)
!149 = !DIFile(filename: "lib/os/printk.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llext_const_symbol", file: !152, line: 30, size: 64, elements: !153)
!152 = !DIFile(filename: "include/zephyr/llext/symbol.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!153 = !{!154, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !152, line: 32, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !151, file: !152, line: 35, baseType: !157, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DISubroutineType(types: !162)
!162 = !{!95, !95}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "threads_table", scope: !165, file: !169, line: 68, type: !381, isLocal: true, isDefinition: true)
!165 = distinct !DICompileUnit(language: DW_LANG_C99, file: !166, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !167, retainedTypes: !203, globals: !366, splitDebugInlining: false, nameTableKind: None)
!166 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/arch/posix/core/posix_core.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!167 = !{!168, !168, !5}
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 60, baseType: !7, size: 32, elements: !197)
!169 = !DIFile(filename: "arch/posix/core/posix_core.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "threads_table_el", file: !169, line: 59, size: 160, elements: !171)
!171 = !{!172, !173, !175, !179, !180}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !170, file: !169, line: 60, baseType: !168, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !170, file: !169, line: 61, baseType: !174, size: 8, offset: 32)
!174 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !170, file: !169, line: 62, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !177, line: 27, baseType: !178)
!177 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "")
!178 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "thead_cnt", scope: !170, file: !169, line: 63, baseType: !95, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "t_status", scope: !170, file: !169, line: 65, baseType: !181, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "posix_thread_status_t", file: !183, line: 39, baseType: !184)
!183 = !DIFile(filename: "arch/posix/include/posix_core.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 16, size: 192, elements: !185)
!185 = !{!186, !192, !193, !194, !195, !196}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "entry_point", scope: !184, file: !183, line: 17, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !188, line: 46, baseType: !189)
!188 = !DIFile(filename: "include/zephyr/sys/arch_interface.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !90, !90, !90}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "arg1", scope: !184, file: !183, line: 18, baseType: !90, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "arg2", scope: !184, file: !183, line: 19, baseType: !90, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "arg3", scope: !184, file: !183, line: 20, baseType: !90, size: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "thread_idx", scope: !184, file: !183, line: 22, baseType: !95, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", scope: !184, file: !183, line: 27, baseType: !95, size: 32, offset: 160)
!197 = !{!198, !199, !200, !201, !202}
!198 = !DIEnumerator(name: "NOTUSED", value: 0, isUnsigned: true)
!199 = !DIEnumerator(name: "USED", value: 1, isUnsigned: true)
!200 = !DIEnumerator(name: "ABORTING", value: 2, isUnsigned: true)
!201 = !DIEnumerator(name: "ABORTED", value: 3, isUnsigned: true)
!202 = !DIEnumerator(name: "FAILED", value: 4, isUnsigned: true)
!203 = !{!90, !204, !208, !210, !227, !231, !267, !269, !298, !95, !299, !334, !337, !338, !341, !174, !344, !364, !365}
!204 = !DISubprogram(name: "pthread_exit", scope: !205, file: !205, line: 211, type: !206, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !100)
!205 = !DIFile(filename: "/usr/include/pthread.h", directory: "")
!206 = !DISubroutineType(types: !207)
!207 = !{null, !90}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !209, line: 93, baseType: !95)
!209 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!210 = !DISubprogram(name: "pthread_create", scope: !205, file: !205, line: 202, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!211 = !DISubroutineType(types: !212)
!212 = !{!95, !213, !214, !224, !90}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "pthread_attr_t", file: !177, line: 56, size: 288, elements: !217)
!217 = !{!218, !222}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !216, file: !177, line: 58, baseType: !219, size: 288)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 288, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 36)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !216, file: !177, line: 59, baseType: !223, size: 32)
!223 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DISubroutineType(types: !226)
!226 = !{!90, !90}
!227 = !DISubprogram(name: "posix_print_error_and_exit", scope: !228, file: !228, line: 18, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!228 = !DIFile(filename: "include/zephyr/arch/posix/posix_trace.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!229 = !DISubroutineType(types: !230)
!230 = !{null, !98, null}
!231 = !DISubprogram(name: "pthread_mutex_lock", scope: !205, file: !205, line: 794, type: !232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!232 = !DISubroutineType(types: !233)
!233 = !{!95, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !177, line: 67, size: 192, elements: !236)
!236 = !{!237, !262, !266}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !235, file: !177, line: 69, baseType: !238, size: 192)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !239, line: 22, size: 192, elements: !240)
!239 = !DIFile(filename: "/usr/include/bits/struct_mutex.h", directory: "")
!240 = !{!241, !242, !243, !244, !245, !246}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !238, file: !239, line: 24, baseType: !95, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !238, file: !239, line: 25, baseType: !7, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !238, file: !239, line: 26, baseType: !95, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !238, file: !239, line: 32, baseType: !95, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !238, file: !239, line: 39, baseType: !7, size: 32, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !239, line: 40, baseType: !247, size: 32, offset: 160)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !239, line: 40, size: 32, elements: !248)
!248 = !{!249, !255}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__elision_data", scope: !247, file: !239, line: 48, baseType: !250, size: 32)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !247, file: !239, line: 42, size: 32, elements: !251)
!251 = !{!252, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__espins", scope: !250, file: !239, line: 44, baseType: !253, size: 16)
!253 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__eelision", scope: !250, file: !239, line: 45, baseType: !253, size: 16, offset: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !247, file: !239, line: 49, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_slist_t", file: !257, line: 60, baseType: !258)
!257 = !DIFile(filename: "/usr/include/bits/thread-shared-types.h", directory: "")
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_slist", file: !257, line: 57, size: 32, elements: !259)
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !258, file: !257, line: 59, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !235, file: !177, line: 70, baseType: !263, size: 192)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 192, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 24)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !235, file: !177, line: 71, baseType: !223, size: 32)
!267 = !DISubprogram(name: "free", scope: !268, file: !268, line: 555, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!268 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!269 = !DISubprogram(name: "z_timeout_expires", scope: !102, file: !102, line: 646, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!270 = !DISubroutineType(types: !271)
!271 = !{!105, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !109, line: 254, size: 160, elements: !275)
!275 = !{!276, !291, !297}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !274, file: !109, line: 255, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !113, line: 55, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !113, line: 37, size: 64, elements: !279)
!279 = !{!280, !286}
!280 = !DIDerivedType(tag: DW_TAG_member, scope: !278, file: !113, line: 38, baseType: !281, size: 32)
!281 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !278, file: !113, line: 38, size: 32, elements: !282)
!282 = !{!283, !285}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !281, file: !113, line: 39, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !113, line: 40, baseType: !284, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, scope: !278, file: !113, line: 42, baseType: !287, size: 32, offset: 32)
!287 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !278, file: !113, line: 42, size: 32, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !287, file: !113, line: 43, baseType: !284, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !287, file: !113, line: 44, baseType: !284, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !274, file: !109, line: 256, baseType: !292, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !109, line: 252, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !274, file: !109, line: 259, baseType: !134, size: 64, offset: 96)
!298 = !DISubprogram(name: "z_timeout_remaining", scope: !102, file: !102, line: 647, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!299 = !DISubprogram(name: "pthread_cond_broadcast", scope: !205, file: !205, line: 1125, type: !300, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!300 = !DISubroutineType(types: !301)
!301 = !{!95, !302}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !177, line: 75, size: 384, elements: !304)
!304 = !{!305, !329, !333}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !303, file: !177, line: 77, baseType: !306, size: 384)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !257, line: 94, size: 384, elements: !307)
!307 = !{!308, !320, !321, !325, !326, !327, !328}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !306, file: !257, line: 96, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !310, line: 33, baseType: !311)
!310 = !DIFile(filename: "/usr/include/bits/atomic_wide_counter.h", directory: "")
!311 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !310, line: 25, size: 64, elements: !312)
!312 = !{!313, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !311, file: !310, line: 27, baseType: !314, size: 64)
!314 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !311, file: !310, line: 32, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !311, file: !310, line: 28, size: 64, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !316, file: !310, line: 30, baseType: !7, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !316, file: !310, line: 31, baseType: !7, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !306, file: !257, line: 97, baseType: !309, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !306, file: !257, line: 98, baseType: !322, size: 64, offset: 128)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 2)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !306, file: !257, line: 99, baseType: !322, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !306, file: !257, line: 100, baseType: !7, size: 32, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !306, file: !257, line: 101, baseType: !7, size: 32, offset: 288)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !306, file: !257, line: 102, baseType: !322, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !303, file: !177, line: 78, baseType: !330, size: 384)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 384, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 48)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !303, file: !177, line: 79, baseType: !105, size: 64)
!334 = !DISubprogram(name: "pthread_cond_wait", scope: !205, file: !205, line: 1133, type: !335, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!335 = !DISubroutineType(types: !336)
!336 = !{!95, !302, !234}
!337 = !DISubprogram(name: "pthread_mutex_unlock", scope: !205, file: !205, line: 835, type: !232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!338 = !DISubprogram(name: "pthread_self", scope: !205, file: !205, line: 273, type: !339, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!339 = !DISubroutineType(types: !340)
!340 = !{!178}
!341 = !DISubprogram(name: "pthread_detach", scope: !205, file: !205, line: 269, type: !342, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!342 = !DISubroutineType(types: !343)
!343 = !{!95, !178}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !346, line: 26, size: 1248, elements: !347)
!346 = !DIFile(filename: "/usr/include/bits/types/struct___jmp_buf_tag.h", directory: "")
!347 = !{!348, !354, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !345, file: !346, line: 32, baseType: !349, size: 192)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !350, line: 35, baseType: !351)
!350 = !DIFile(filename: "/usr/include/bits/setjmp.h", directory: "")
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 192, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 6)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !345, file: !346, line: 33, baseType: !95, size: 32, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !345, file: !346, line: 34, baseType: !356, size: 1024, offset: 224)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !357, line: 8, baseType: !358)
!357 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 5, size: 1024, elements: !359)
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !358, file: !357, line: 7, baseType: !361, size: 1024)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 1024, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 32)
!364 = !DISubprogram(name: "posix_arch_thread_entry", scope: !169, file: !169, line: 87, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!365 = !DISubprogram(name: "posix_print_trace", scope: !228, file: !228, line: 20, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!366 = !{!367, !163, !369, !371, !373, !375, !378}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "threads_table_size", scope: !165, file: !169, line: 58, type: !95, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "thread_create_count", scope: !165, file: !169, line: 70, type: !95, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "currently_allowed_thread", scope: !165, file: !169, line: 80, type: !95, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "terminate", scope: !165, file: !169, line: 82, type: !174, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "cond_threads", scope: !165, file: !169, line: 76, type: !377, isLocal: true, isDefinition: true)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !177, line: 80, baseType: !303)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "mtx_threads", scope: !165, file: !169, line: 78, type: !380, isLocal: true, isDefinition: true)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !177, line: 72, baseType: !235)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!382 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "nce_st", scope: !385, file: !448, line: 36, type: !90, isLocal: true, isDefinition: true)
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !387, globals: !447, splitDebugInlining: false, nameTableKind: None)
!386 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/soc/posix/inf_clock/soc.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!387 = !{!388, !392, !393, !394, !398, !400, !403, !406, !407, !411, !412, !413, !90, !417, !446, !95}
!388 = !DISubprogram(name: "nce_is_cpu_running", scope: !389, file: !389, line: 20, type: !390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!389 = !DIFile(filename: "arch/posix/core/nsi_compat/nce_if.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!390 = !DISubroutineType(types: !391)
!391 = !{!95, !90}
!392 = !DISubprogram(name: "nce_halt_cpu", scope: !389, file: !389, line: 18, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!393 = !DISubprogram(name: "nce_wake_cpu", scope: !389, file: !389, line: 19, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!394 = !DISubprogram(name: "posix_irq_handler", scope: !395, file: !395, line: 24, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!395 = !DIFile(filename: "soc/posix/inf_clock/posix_board_if.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!396 = !DISubroutineType(types: !397)
!397 = !{null}
!398 = !DISubprogram(name: "posix_irq_full_unlock", scope: !399, file: !399, line: 32, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!399 = !DIFile(filename: "include/zephyr/arch/posix/posix_soc_if.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!400 = !DISubprogram(name: "posix_irq_unlock", scope: !399, file: !399, line: 31, type: !401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !7}
!403 = !DISubprogram(name: "nce_init", scope: !389, file: !389, line: 15, type: !404, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!404 = !DISubroutineType(types: !405)
!405 = !{!90}
!406 = !DISubprogram(name: "posix_arch_init", scope: !183, file: !183, line: 43, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!407 = !DISubprogram(name: "nce_boot_cpu", scope: !389, file: !389, line: 17, type: !408, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !90, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!411 = !DISubprogram(name: "nce_terminate", scope: !389, file: !389, line: 16, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!412 = !DISubprogram(name: "posix_arch_clean_up", scope: !183, file: !183, line: 44, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!413 = !DISubprogram(name: "run_native_tasks", scope: !414, file: !414, line: 58, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!414 = !DIFile(filename: "soc/posix/inf_clock/posix_native_task.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!415 = !DISubroutineType(types: !416)
!416 = !{null, !95}
!417 = !DISubprogram(name: "z_timeout_expires", scope: !102, file: !102, line: 646, type: !418, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!418 = !DISubroutineType(types: !419)
!419 = !{!105, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !109, line: 254, size: 160, elements: !423)
!423 = !{!424, !439, !445}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !422, file: !109, line: 255, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !113, line: 55, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !113, line: 37, size: 64, elements: !427)
!427 = !{!428, !434}
!428 = !DIDerivedType(tag: DW_TAG_member, scope: !426, file: !113, line: 38, baseType: !429, size: 32)
!429 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !426, file: !113, line: 38, size: 32, elements: !430)
!430 = !{!431, !433}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !429, file: !113, line: 39, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !113, line: 40, baseType: !432, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, scope: !426, file: !113, line: 42, baseType: !435, size: 32, offset: 32)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !426, file: !113, line: 42, size: 32, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !435, file: !113, line: 43, baseType: !432, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !435, file: !113, line: 44, baseType: !432, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !422, file: !109, line: 256, baseType: !440, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !109, line: 252, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !422, file: !109, line: 259, baseType: !134, size: 64, offset: 96)
!446 = !DISubprogram(name: "z_timeout_remaining", scope: !102, file: !102, line: 647, type: !418, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!447 = !{!383}
!448 = !DIFile(filename: "soc/posix/inf_clock/soc.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "native_pre_tasks", scope: !451, file: !452, line: 21, type: !460, isLocal: true, isDefinition: true)
!451 = distinct !DISubprogram(name: "run_native_tasks", scope: !452, file: !452, line: 12, type: !415, scopeLine: 13, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !453, retainedNodes: !456)
!452 = !DIFile(filename: "soc/posix/inf_clock/native_tasks.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !100, globals: !455, splitDebugInlining: false, nameTableKind: None)
!454 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/soc/posix/inf_clock/native_tasks.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!455 = !{!449}
!456 = !{!457, !458}
!457 = !DILocalVariable(name: "level", arg: 1, scope: !451, file: !452, line: 12, type: !95)
!458 = !DILocalVariable(name: "fptr", scope: !451, file: !452, line: 30, type: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 192, elements: !352)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "signaled_end", scope: !463, file: !467, line: 52, type: !613, isLocal: true, isDefinition: true)
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !465, retainedTypes: !474, globals: !598, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/boards/posix/native_posix/hw_models_top.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!465 = !{!466}
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 35, baseType: !7, size: 32, elements: !468)
!467 = !DIFile(filename: "boards/posix/native_posix/hw_models_top.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!468 = !{!469, !470, !471, !472, !473}
!469 = !DIEnumerator(name: "HWTIMER", value: 0, isUnsigned: true)
!470 = !DIEnumerator(name: "IRQCNT", value: 1, isUnsigned: true)
!471 = !DIEnumerator(name: "HW_COUNTER", value: 2, isUnsigned: true)
!472 = !DIEnumerator(name: "NUMBER_OF_TIMERS", value: 3, isUnsigned: true)
!473 = !DIEnumerator(name: "NONE", value: 4, isUnsigned: true)
!474 = !{!475, !483, !581, !583, !585, !227, !587, !588, !589, !590, !591, !174, !592, !595, !596, !365, !597}
!475 = !DISubprogram(name: "sigemptyset", scope: !476, file: !476, line: 199, type: !477, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!476 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!477 = !DISubroutineType(types: !478)
!478 = !{!95, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 5, size: 1024, elements: !481)
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !480, file: !357, line: 7, baseType: !361, size: 1024)
!483 = !DISubprogram(name: "sigaction", scope: !476, file: !476, line: 243, type: !484, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!484 = !DISubroutineType(types: !485)
!485 = !{!95, !95, !486, !580}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !489, line: 27, size: 1120, elements: !490)
!489 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!490 = !{!491, !576, !578, !579}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !488, file: !489, line: 38, baseType: !492, size: 32)
!492 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !488, file: !489, line: 31, size: 32, elements: !493)
!493 = !{!494, !497}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !492, file: !489, line: 34, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !476, line: 72, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !492, file: !489, line: 36, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !95, !501, !90}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !503, line: 124, baseType: !504)
!503 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 36, size: 1024, elements: !505)
!505 = !{!506, !507, !508, !509}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !504, file: !503, line: 38, baseType: !95, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !504, file: !503, line: 40, baseType: !95, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !504, file: !503, line: 42, baseType: !95, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !504, file: !503, line: 123, baseType: !510, size: 928, offset: 96)
!510 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !504, file: !503, line: 51, size: 928, elements: !511)
!511 = !{!512, !516, !523, !535, !541, !550, !565, !570}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !510, file: !503, line: 53, baseType: !513, size: 928)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 928, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 29)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !510, file: !503, line: 60, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !510, file: !503, line: 56, size: 64, elements: !518)
!518 = !{!519, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !517, file: !503, line: 58, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !137, line: 154, baseType: !95)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !517, file: !503, line: 59, baseType: !522, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !137, line: 146, baseType: !7)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !510, file: !503, line: 68, baseType: !524, size: 96)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !510, file: !503, line: 63, size: 96, elements: !525)
!525 = !{!526, !527, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !524, file: !503, line: 65, baseType: !95, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !524, file: !503, line: 66, baseType: !95, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !524, file: !503, line: 67, baseType: !529, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !530, line: 30, baseType: !531)
!530 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!531 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !530, line: 24, size: 32, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !531, file: !530, line: 26, baseType: !95, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !531, file: !530, line: 27, baseType: !90, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !510, file: !503, line: 76, baseType: !536, size: 96)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !510, file: !503, line: 71, size: 96, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !536, file: !503, line: 73, baseType: !520, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !536, file: !503, line: 74, baseType: !522, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !536, file: !503, line: 75, baseType: !529, size: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !510, file: !503, line: 86, baseType: !542, size: 160)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !510, file: !503, line: 79, size: 160, elements: !543)
!543 = !{!544, !545, !546, !547, !549}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !542, file: !503, line: 81, baseType: !520, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !542, file: !503, line: 82, baseType: !522, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !542, file: !503, line: 83, baseType: !95, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !542, file: !503, line: 84, baseType: !548, size: 32, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !137, line: 156, baseType: !223)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !542, file: !503, line: 85, baseType: !548, size: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !510, file: !503, line: 105, baseType: !551, size: 128)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !510, file: !503, line: 89, size: 128, elements: !552)
!552 = !{!553, !554, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !551, file: !503, line: 91, baseType: !90, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !551, file: !503, line: 93, baseType: !253, size: 16, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !551, file: !503, line: 104, baseType: !556, size: 64, offset: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !551, file: !503, line: 94, size: 64, elements: !557)
!557 = !{!558, !563}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !556, file: !503, line: 101, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !556, file: !503, line: 97, size: 64, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !559, file: !503, line: 99, baseType: !90, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !559, file: !503, line: 100, baseType: !90, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !556, file: !503, line: 103, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !137, line: 42, baseType: !7)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !510, file: !503, line: 112, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !510, file: !503, line: 108, size: 64, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !566, file: !503, line: 110, baseType: !223, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !566, file: !503, line: 111, baseType: !95, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !510, file: !503, line: 121, baseType: !571, size: 96)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !510, file: !503, line: 116, size: 96, elements: !572)
!572 = !{!573, !574, !575}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !571, file: !503, line: 118, baseType: !90, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !571, file: !503, line: 119, baseType: !95, size: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !571, file: !503, line: 120, baseType: !7, size: 32, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !488, file: !489, line: 46, baseType: !577, size: 1024, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !357, line: 8, baseType: !480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !488, file: !489, line: 49, baseType: !95, size: 32, offset: 1056)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !488, file: !489, line: 52, baseType: !410, size: 32, offset: 1088)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!581 = !DISubprogram(name: "hwtimer_timer_reached", scope: !582, file: !582, line: 20, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!582 = !DIFile(filename: "boards/posix/native_posix/timer_model.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!583 = !DISubprogram(name: "hw_irq_ctrl_timer_triggered", scope: !584, file: !584, line: 18, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!584 = !DIFile(filename: "boards/posix/native_posix/irq_ctrl.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!585 = !DISubprogram(name: "hw_counter_triggered", scope: !586, file: !586, line: 17, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!586 = !DIFile(filename: "boards/posix/native_posix/hw_counter.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!587 = !DISubprogram(name: "hwtimer_init", scope: !582, file: !582, line: 17, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!588 = !DISubprogram(name: "hw_counter_init", scope: !586, file: !586, line: 16, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!589 = !DISubprogram(name: "hw_irq_ctrl_init", scope: !584, file: !584, line: 16, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!590 = !DISubprogram(name: "hwtimer_cleanup", scope: !582, file: !582, line: 18, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!591 = !DISubprogram(name: "hw_irq_ctrl_cleanup", scope: !584, file: !584, line: 17, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !593, line: 27, baseType: !594)
!593 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !137, line: 48, baseType: !314)
!595 = !DISubprogram(name: "posix_print_warning", scope: !228, file: !228, line: 19, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!596 = !DIBasicType(name: "long double", size: 96, encoding: DW_ATE_float)
!597 = !DISubprogram(name: "posix_exit", scope: !395, file: !395, line: 25, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!598 = !{!599, !601, !461, !603, !605, !611}
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "simu_time", scope: !463, file: !467, line: 27, type: !592, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "next_timer_time", scope: !463, file: !467, line: 49, type: !592, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "next_timer_index", scope: !463, file: !467, line: 41, type: !466, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "Timer_list", scope: !463, file: !467, line: 43, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 96, elements: !609)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!609 = !{!610}
!610 = !DISubrange(count: 3)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "end_of_time", scope: !463, file: !467, line: 28, type: !592, isLocal: true, isDefinition: true)
!613 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !615, line: 8, baseType: !616)
!615 = !DIFile(filename: "/usr/include/bits/types/sig_atomic_t.h", directory: "")
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !137, line: 215, baseType: !95)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "hw_timer_tick_timer", scope: !619, file: !672, line: 69, type: !592, isLocal: false, isDefinition: true)
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !100, retainedTypes: !621, globals: !669, splitDebugInlining: false, nameTableKind: None)
!620 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/boards/posix/native_posix/timer_model.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!621 = !{!592, !622, !634, !638, !596, !639, !640, !645, !227, !666}
!622 = !DISubprogram(name: "clock_gettime", scope: !623, file: !623, line: 279, type: !624, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!623 = !DIFile(filename: "/usr/include/time.h", directory: "")
!624 = !DISubroutineType(types: !625)
!625 = !{!95, !95, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !628, line: 11, size: 64, elements: !629)
!628 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!629 = !{!630, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !627, file: !628, line: 16, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !137, line: 160, baseType: !223)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !627, file: !628, line: 21, baseType: !633, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !137, line: 197, baseType: !223)
!634 = !DISubprogram(name: "hwm_get_time", scope: !635, file: !635, line: 23, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!635 = !DIFile(filename: "boards/posix/native_posix/hw_models_top.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!636 = !DISubroutineType(types: !637)
!637 = !{!314}
!638 = !DISubprogram(name: "hwm_find_next_timer", scope: !635, file: !635, line: 24, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!639 = !DISubprogram(name: "hw_irq_ctrl_set_irq", scope: !584, file: !584, line: 34, type: !401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!640 = !DISubprogram(name: "nanosleep", scope: !623, file: !623, line: 272, type: !641, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!641 = !DISubroutineType(types: !642)
!642 = !{!95, !643, !626}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!645 = !DISubprogram(name: "native_add_command_line_opts", scope: !646, file: !646, line: 19, type: !647, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!646 = !DIFile(filename: "boards/posix/native_posix/cmdline.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!647 = !DISubroutineType(types: !648)
!648 = !{null, !649}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "args_struct_t", file: !651, line: 42, size: 224, elements: !652)
!651 = !DIFile(filename: "boards/posix/native_posix/cmdline_common.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !665}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "manual", scope: !650, file: !651, line: 48, baseType: !174, size: 8)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "is_mandatory", scope: !650, file: !651, line: 50, baseType: !174, size: 8, offset: 8)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "is_switch", scope: !650, file: !651, line: 52, baseType: !174, size: 8, offset: 16)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !650, file: !651, line: 54, baseType: !96, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !650, file: !651, line: 59, baseType: !96, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !650, file: !651, line: 61, baseType: !97, size: 8, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !650, file: !651, line: 63, baseType: !90, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "call_when_found", scope: !650, file: !651, line: 65, baseType: !661, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "option_found_callback_f", file: !651, line: 37, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !96, !95}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "descript", scope: !650, file: !651, line: 67, baseType: !96, size: 32, offset: 192)
!666 = !DISubprogram(name: "hwm_set_end_of_time", scope: !635, file: !635, line: 22, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !314}
!669 = !{!670, !677, !617, !679, !681, !683, !685, !687, !689, !691, !693, !695, !697, !700, !706}
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "__native_task_native_add_time_options", scope: !619, file: !672, line: 546, type: !673, isLocal: true, isDefinition: true)
!672 = !DIFile(filename: "boards/posix/native_posix/timer_model.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DISubroutineType(types: !676)
!676 = !{null, null}
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "hw_timer_timer", scope: !619, file: !672, line: 67, type: !592, isLocal: false, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "hw_timer_awake_timer", scope: !619, file: !672, line: 70, type: !592, isLocal: false, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "tick_p", scope: !619, file: !672, line: 72, type: !592, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "silent_ticks", scope: !619, file: !672, line: 73, type: !134, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "reset_rtc", scope: !619, file: !672, line: 82, type: !174, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "boot_time", scope: !619, file: !672, line: 88, type: !592, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "rtc_offset", scope: !619, file: !672, line: 113, type: !134, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "last_radj_rtime", scope: !619, file: !672, line: 116, type: !592, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "last_radj_stime", scope: !619, file: !672, line: 118, type: !592, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "real_time_mode", scope: !619, file: !672, line: 75, type: !174, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "clock_ratio", scope: !619, file: !672, line: 95, type: !699, isLocal: true, isDefinition: true)
!699 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "timer_options", scope: !702, file: !672, line: 482, type: !703, isLocal: true, isDefinition: true)
!702 = distinct !DISubprogram(name: "native_add_time_options", scope: !672, file: !672, line: 480, type: !396, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !619, retainedNodes: !100)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 1792, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 8)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "args", scope: !619, file: !672, line: 417, type: !708, isLocal: true, isDefinition: true)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 412, size: 256, elements: !709)
!709 = !{!710, !711, !712, !713}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "stop_at", scope: !708, file: !672, line: 413, baseType: !699, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "rtc_offset", scope: !708, file: !672, line: 414, baseType: !699, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rt_drift", scope: !708, file: !672, line: 415, baseType: !699, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rt_ratio", scope: !708, file: !672, line: 416, baseType: !699, size: 64, offset: 192)
!714 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "may_swap", scope: !717, file: !718, line: 70, type: !95, isLocal: true, isDefinition: true)
!717 = distinct !DISubprogram(name: "posix_irq_handler", scope: !718, file: !718, line: 66, type: !396, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !719, retainedNodes: !806)
!718 = !DIFile(filename: "boards/posix/native_posix/irq_handler.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !721, globals: !790, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/boards/posix/native_posix/irq_handler.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!721 = !{!722, !725, !728, !729, !733, !734, !735, !227, !737, !740, !741, !742, !745, !748, !90, !749, !778, !95, !779, !781, !783, !787, !788}
!722 = !DISubprogram(name: "hw_irq_ctrl_get_current_lock", scope: !584, file: !584, line: 27, type: !723, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!723 = !DISubroutineType(types: !724)
!724 = !{!7}
!725 = !DISubprogram(name: "hw_irq_ctrl_get_highest_prio_irq", scope: !584, file: !584, line: 26, type: !726, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!726 = !DISubroutineType(types: !727)
!727 = !{!95}
!728 = !DISubprogram(name: "hw_irq_ctrl_get_cur_prio", scope: !584, file: !584, line: 21, type: !726, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!729 = !DISubprogram(name: "hw_irq_ctrl_get_prio", scope: !584, file: !584, line: 24, type: !730, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!730 = !DISubroutineType(types: !731)
!731 = !{!732, !7}
!732 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!733 = !DISubprogram(name: "hw_irq_ctrl_set_cur_prio", scope: !584, file: !584, line: 20, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!734 = !DISubprogram(name: "hw_irq_ctrl_clear_irq", scope: !584, file: !584, line: 32, type: !401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!735 = !DISubprogram(name: "posix_is_cpu_running", scope: !736, file: !736, line: 18, type: !726, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!736 = !DIFile(filename: "soc/posix/inf_clock/posix_soc.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!737 = !DISubprogram(name: "hw_irq_ctrl_change_lock", scope: !584, file: !584, line: 28, type: !738, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!738 = !DISubroutineType(types: !739)
!739 = !{!7, !7}
!740 = !DISubprogram(name: "hw_irq_ctrl_enable_irq", scope: !584, file: !584, line: 33, type: !401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!741 = !DISubprogram(name: "hw_irq_ctrl_disable_irq", scope: !584, file: !584, line: 30, type: !401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!742 = !DISubprogram(name: "hw_irq_ctrl_is_irq_enabled", scope: !584, file: !584, line: 31, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!743 = !DISubroutineType(types: !744)
!744 = !{!95, !7}
!745 = !DISubprogram(name: "hw_irq_ctrl_prio_set", scope: !584, file: !584, line: 23, type: !746, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !7, !7}
!748 = !DISubprogram(name: "hw_irq_ctrl_raise_im_from_sw", scope: !584, file: !584, line: 36, type: !401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!749 = !DISubprogram(name: "z_timeout_expires", scope: !102, file: !102, line: 646, type: !750, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!750 = !DISubroutineType(types: !751)
!751 = !{!105, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !109, line: 254, size: 160, elements: !755)
!755 = !{!756, !771, !777}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !754, file: !109, line: 255, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !113, line: 55, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !113, line: 37, size: 64, elements: !759)
!759 = !{!760, !766}
!760 = !DIDerivedType(tag: DW_TAG_member, scope: !758, file: !113, line: 38, baseType: !761, size: 32)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !758, file: !113, line: 38, size: 32, elements: !762)
!762 = !{!763, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !761, file: !113, line: 39, baseType: !764, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !761, file: !113, line: 40, baseType: !764, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, scope: !758, file: !113, line: 42, baseType: !767, size: 32, offset: 32)
!767 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !758, file: !113, line: 42, size: 32, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !767, file: !113, line: 43, baseType: !764, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !767, file: !113, line: 44, baseType: !764, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !754, file: !109, line: 256, baseType: !772, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !109, line: 252, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !754, file: !109, line: 259, baseType: !134, size: 64, offset: 96)
!778 = !DISubprogram(name: "z_timeout_remaining", scope: !102, file: !102, line: 647, type: !750, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!779 = !DISubprogram(name: "sys_trace_isr_enter", scope: !780, file: !780, line: 2001, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!780 = !DIFile(filename: "include/zephyr/tracing/tracing.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "direct_irq_f_ptr", file: !718, line: 24, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "normal_irq_f_ptr", file: !718, line: 23, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !158}
!787 = !DISubprogram(name: "sys_trace_isr_exit", scope: !780, file: !780, line: 2006, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!788 = !DISubprogram(name: "arch_swap", scope: !789, file: !789, line: 198, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!789 = !DIFile(filename: "kernel/include/kswap.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!790 = !{!715, !791, !793}
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "currently_running_irq", scope: !719, file: !718, line: 29, type: !95, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "irq_vector_table", scope: !719, file: !718, line: 27, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 4096, elements: !362)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "isr_table_entry_t", file: !718, line: 26, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !798, line: 53, size: 128, elements: !799)
!798 = !DIFile(filename: "include/zephyr/sw_isr_table.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!799 = !{!800, !803, !804, !805}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !797, file: !798, line: 55, baseType: !801, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !135, line: 26, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !137, line: 41, baseType: !95)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !797, file: !798, line: 57, baseType: !801, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !797, file: !798, line: 59, baseType: !90, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !797, file: !798, line: 61, baseType: !158, size: 32, offset: 96)
!806 = !{!807, !808, !809, !811}
!807 = !DILocalVariable(name: "irq_lock", scope: !717, file: !718, line: 68, type: !592)
!808 = !DILocalVariable(name: "irq_nbr", scope: !717, file: !718, line: 69, type: !95)
!809 = !DILocalVariable(name: "last_current_running_prio", scope: !810, file: !718, line: 86, type: !95)
!810 = distinct !DILexicalBlock(scope: !717, file: !718, line: 85, column: 63)
!811 = !DILocalVariable(name: "last_running_irq", scope: !810, file: !718, line: 87, type: !95)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "irq_ctrl_timer", scope: !814, file: !824, line: 19, type: !592, isLocal: false, isDefinition: true)
!814 = distinct !DICompileUnit(language: DW_LANG_C99, file: !815, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !100, retainedTypes: !816, globals: !821, splitDebugInlining: false, nameTableKind: None)
!815 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/boards/posix/native_posix/irq_ctrl.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!816 = !{!817, !592, !95, !818, !748, !634, !638, !820}
!817 = !DISubprogram(name: "hw_irq_ctrl_get_irq_status", scope: !584, file: !584, line: 29, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!818 = !DISubprogram(name: "posix_irq_handler_im_from_sw", scope: !819, file: !819, line: 17, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!819 = !DIFile(filename: "boards/posix/native_posix/irq_handler.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!820 = !DISubprogram(name: "posix_interrupt_raised", scope: !736, file: !736, line: 16, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!821 = !{!812, !822, !825, !827, !829, !831, !833, !838}
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "irq_status", scope: !814, file: !824, line: 22, type: !592, isLocal: true, isDefinition: true)
!824 = !DIFile(filename: "boards/posix/native_posix/irq_ctrl.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "irq_premask", scope: !814, file: !824, line: 23, type: !592, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "irq_mask", scope: !814, file: !824, line: 33, type: !592, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "irqs_locked", scope: !814, file: !824, line: 40, type: !174, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "lock_ignore", scope: !814, file: !824, line: 41, type: !174, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "irq_prio", scope: !814, file: !824, line: 43, type: !835, isLocal: true, isDefinition: true)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 256, elements: !362)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !593, line: 24, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !137, line: 38, baseType: !732)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "currently_running_prio", scope: !814, file: !824, line: 46, type: !95, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "max_exit_code", scope: !843, file: !844, line: 40, type: !95, isLocal: true, isDefinition: true)
!843 = distinct !DISubprogram(name: "posix_exit", scope: !844, file: !844, line: 38, type: !415, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !845, retainedNodes: !917)
!844 = !DIFile(filename: "boards/posix/native_posix/main.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !100, retainedTypes: !847, globals: !916, splitDebugInlining: false, nameTableKind: None)
!846 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/boards/posix/native_posix/main.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!847 = !{!848, !850, !851, !852, !413, !909, !913, !914, !634, !915}
!848 = !DISubprogram(name: "posix_soc_clean_up", scope: !849, file: !849, line: 19, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!849 = !DIFile(filename: "soc/posix/inf_clock/soc.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!850 = !DISubprogram(name: "hwm_cleanup", scope: !635, file: !635, line: 21, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!851 = !DISubprogram(name: "native_cleanup_cmd_line", scope: !646, file: !646, line: 20, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!852 = !DISubprogram(name: "setvbuf", scope: !853, file: !853, line: 332, type: !854, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!853 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!854 = !DISubroutineType(types: !855)
!855 = !{!95, !856, !96, !95, !7}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !858, line: 49, size: 1184, elements: !859)
!858 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!859 = !{!860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !875, !876, !877, !878, !880, !882, !884, !888, !891, !893, !896, !899, !900, !901, !904, !905}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !857, file: !858, line: 51, baseType: !95, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !857, file: !858, line: 54, baseType: !96, size: 32, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !857, file: !858, line: 55, baseType: !96, size: 32, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !857, file: !858, line: 56, baseType: !96, size: 32, offset: 96)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !857, file: !858, line: 57, baseType: !96, size: 32, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !857, file: !858, line: 58, baseType: !96, size: 32, offset: 160)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !857, file: !858, line: 59, baseType: !96, size: 32, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !857, file: !858, line: 60, baseType: !96, size: 32, offset: 224)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !857, file: !858, line: 61, baseType: !96, size: 32, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !857, file: !858, line: 64, baseType: !96, size: 32, offset: 288)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !857, file: !858, line: 65, baseType: !96, size: 32, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !857, file: !858, line: 66, baseType: !96, size: 32, offset: 352)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !857, file: !858, line: 68, baseType: !873, size: 32, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !858, line: 36, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !857, file: !858, line: 70, baseType: !856, size: 32, offset: 416)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !857, file: !858, line: 72, baseType: !95, size: 32, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !857, file: !858, line: 73, baseType: !95, size: 32, offset: 480)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !857, file: !858, line: 74, baseType: !879, size: 32, offset: 512)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !137, line: 152, baseType: !223)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !857, file: !858, line: 77, baseType: !881, size: 16, offset: 544)
!881 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !857, file: !858, line: 78, baseType: !883, size: 8, offset: 560)
!883 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !857, file: !858, line: 79, baseType: !885, size: 8, offset: 568)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 8, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 1)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !857, file: !858, line: 81, baseType: !889, size: 32, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !858, line: 43, baseType: null)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !857, file: !858, line: 89, baseType: !892, size: 64, offset: 608)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !137, line: 153, baseType: !136)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !857, file: !858, line: 91, baseType: !894, size: 32, offset: 672)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !858, line: 37, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !857, file: !858, line: 92, baseType: !897, size: 32, offset: 704)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !858, line: 38, flags: DIFlagFwdDecl)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !857, file: !858, line: 93, baseType: !856, size: 32, offset: 736)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !857, file: !858, line: 94, baseType: !90, size: 32, offset: 768)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !857, file: !858, line: 95, baseType: !902, size: 32, offset: 800)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !903, line: 46, baseType: !7)
!903 = !DIFile(filename: "/llvm-project-10.0.1/build/lib/clang/10.0.1/include/stddef.h", directory: "")
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !857, file: !858, line: 96, baseType: !95, size: 32, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !857, file: !858, line: 98, baseType: !906, size: 320, offset: 864)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 320, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 40)
!909 = !DISubprogram(name: "native_handle_cmd_line", scope: !646, file: !646, line: 16, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !95, !912}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 32)
!913 = !DISubprogram(name: "hwm_init", scope: !635, file: !635, line: 20, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!914 = !DISubprogram(name: "posix_boot_cpu", scope: !736, file: !736, line: 17, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!915 = !DISubprogram(name: "hwm_one_event", scope: !635, file: !635, line: 19, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!916 = !{!841}
!917 = !{!918}
!918 = !DILocalVariable(name: "exit_code", arg: 1, scope: !843, file: !844, line: 38, type: !95)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "__native_task_decide_about_color", scope: !921, file: !945, line: 105, type: !673, isLocal: true, isDefinition: true)
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !100, retainedTypes: !923, globals: !941, splitDebugInlining: false, nameTableKind: None)
!922 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/boards/posix/native_posix/tracing.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!923 = !{!597, !924, !939}
!924 = !DISubprogram(name: "native_add_command_line_opts", scope: !646, file: !646, line: 19, type: !925, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !927}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "args_struct_t", file: !651, line: 42, size: 224, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937, !938}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "manual", scope: !928, file: !651, line: 48, baseType: !174, size: 8)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "is_mandatory", scope: !928, file: !651, line: 50, baseType: !174, size: 8, offset: 8)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "is_switch", scope: !928, file: !651, line: 52, baseType: !174, size: 8, offset: 16)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !928, file: !651, line: 54, baseType: !96, size: 32, offset: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !928, file: !651, line: 59, baseType: !96, size: 32, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !928, file: !651, line: 61, baseType: !97, size: 8, offset: 96)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !928, file: !651, line: 63, baseType: !90, size: 32, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "call_when_found", scope: !928, file: !651, line: 65, baseType: !661, size: 32, offset: 160)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "descript", scope: !928, file: !651, line: 67, baseType: !96, size: 32, offset: 192)
!939 = !DISubprogram(name: "isatty", scope: !940, file: !940, line: 809, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!940 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!941 = !{!919, !942, !949}
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "trace_options", scope: !944, file: !945, line: 109, type: !946, isLocal: true, isDefinition: true)
!944 = distinct !DISubprogram(name: "native_add_tracing_options", scope: !945, file: !945, line: 107, type: !396, scopeLine: 108, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !921, retainedNodes: !100)
!945 = !DIFile(filename: "boards/posix/native_posix/tracing.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 896, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 4)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "is_a_tty", scope: !921, file: !945, line: 69, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 64, elements: !323)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "args_struct", scope: !954, file: !985, line: 22, type: !962, isLocal: true, isDefinition: true)
!954 = distinct !DICompileUnit(language: DW_LANG_C99, file: !955, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !100, retainedTypes: !956, globals: !981, splitDebugInlining: false, nameTableKind: None)
!955 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/boards/posix/native_posix/cmdline.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!956 = !{!90, !267, !227, !957, !959, !974, !977, !980}
!957 = !DISubprogram(name: "native_add_tracing_options", scope: !958, file: !958, line: 14, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!958 = !DIFile(filename: "boards/posix/native_posix/native_tracing.h", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!959 = !DISubprogram(name: "cmd_args_set_defaults", scope: !651, file: !651, line: 77, type: !960, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "args_struct_t", file: !651, line: 42, size: 224, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !972, !973}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "manual", scope: !963, file: !651, line: 48, baseType: !174, size: 8)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "is_mandatory", scope: !963, file: !651, line: 50, baseType: !174, size: 8, offset: 8)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "is_switch", scope: !963, file: !651, line: 52, baseType: !174, size: 8, offset: 16)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !963, file: !651, line: 54, baseType: !96, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !963, file: !651, line: 59, baseType: !96, size: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !963, file: !651, line: 61, baseType: !97, size: 8, offset: 96)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !963, file: !651, line: 63, baseType: !90, size: 32, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "call_when_found", scope: !963, file: !651, line: 65, baseType: !661, size: 32, offset: 160)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "descript", scope: !963, file: !651, line: 67, baseType: !96, size: 32, offset: 192)
!974 = !DISubprogram(name: "cmd_is_option", scope: !651, file: !651, line: 73, type: !975, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!975 = !DISubroutineType(types: !976)
!976 = !{!95, !98, !98, !95}
!977 = !DISubprogram(name: "cmd_parse_one_arg", scope: !651, file: !651, line: 78, type: !978, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!978 = !DISubroutineType(types: !979)
!979 = !{!174, !96, !962}
!980 = !DISubprogram(name: "cmd_print_switches_help", scope: !651, file: !651, line: 79, type: !960, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !100)
!981 = !{!982, !987, !989, !991, !993, !952, !995, !997}
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "testargs_options", scope: !984, file: !985, line: 82, type: !986, isLocal: true, isDefinition: true)
!984 = distinct !DISubprogram(name: "native_add_testargs_option", scope: !985, file: !985, line: 80, type: !396, scopeLine: 81, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !954, retainedNodes: !100)
!985 = !DIFile(filename: "boards/posix/native_posix/cmdline.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 448, elements: !323)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "s_argc", scope: !954, file: !985, line: 19, type: !95, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "test_argc", scope: !954, file: !985, line: 19, type: !95, isLocal: true, isDefinition: true)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "s_argv", scope: !954, file: !985, line: 20, type: !912, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "test_argv", scope: !954, file: !985, line: 20, type: !912, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "used_args", scope: !954, file: !985, line: 23, type: !95, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "args_aval", scope: !954, file: !985, line: 24, type: !95, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "hw_counter_timer", scope: !1001, file: !1007, line: 14, type: !592, isLocal: false, isDefinition: true)
!1001 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1002, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !100, retainedTypes: !1003, globals: !1004, splitDebugInlining: false, nameTableKind: None)
!1002 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/boards/posix/native_posix/hw_counter.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!1003 = !{!634, !639, !638}
!1004 = !{!999, !1005, !1008, !1010, !1012, !1014}
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "counter_running", scope: !1001, file: !1007, line: 16, type: !174, isLocal: true, isDefinition: true)
!1007 = !DIFile(filename: "boards/posix/native_posix/hw_counter.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "counter_value", scope: !1001, file: !1007, line: 17, type: !592, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "counter_target", scope: !1001, file: !1007, line: 18, type: !592, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "counter_period", scope: !1001, file: !1007, line: 19, type: !592, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "counter_wrap", scope: !1001, file: !1007, line: 20, type: !592, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "__init_posix_arch_console_init", scope: !1019, file: !1025, line: 64, type: !1031, isLocal: true, isDefinition: true, align: 32)
!1019 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1020, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !100, retainedTypes: !1021, globals: !1022, splitDebugInlining: false, nameTableKind: None)
!1020 = !DIFile(filename: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/drivers/console/posix_arch_console.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr/build")
!1021 = !{!365}
!1022 = !{!1017, !1023, !1029}
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "stdout_buff", scope: !1019, file: !1025, line: 12, type: !1026, isLocal: true, isDefinition: true)
!1025 = !DIFile(filename: "drivers/console/posix_arch_console.c", directory: "/root/Fuzzing_RTOS_Applications/Armclang_Ported_Applications/zephyr")
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 2048, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 256)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
